esxpost/t1

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns2="urn:vim25"><SOAP-ENV:Body><AddHost_Task xmlns="urn:vim25"><_this type="ClusterComputeResource">domain-c146</_this><spec xsi:type="HostConnectSpec"><hostName xsi:type="string">d9t0073c.houston.hp.com</hostName><userName xsi:type="string">root</userName><password xsi:type="string">P@perB0y</password><force xsi:type="boolean">1</force><sslThumbprint xsi:type="string">64:67:9D:D4:E2:4D:B4:52:06:BA:2A:79:FF:D2:C8:B8:32:A1:C0:B2</sslThumbprint></spec><asConnected xsi:type="boolean">1</asConnected><license xsi:type="string">00000-00000-00000-00000-00000</license></AddHost_Task></SOAP-ENV:Body></SOAP-ENV:Envelope>
